#define _CRT_SECURE_NO_WARNINGS
#include <iostream> // Бібліотека вводу/виводу
#include <Windows.h> // Бібліотека для української локалізації в консольному рядку
#define SIZE 7 // Оголошення змінної SIZE зі значенням 3, для вказання розміру масива


int main() {
    SetConsoleOutputCP(1251); // Встановлення української локалізації
    SetConsoleCP(1251); // Встановлення української локалізації

    int numbers[SIZE]; // Оголошення масиву із розміром SIZE або ж 7
    printf("Введіть сім цілих числа: "); // Виведення тексту

    // Цикл для запису введених чисел у масив
    for (int i = 0; i < SIZE; ++i) {
        scanf("%d", &numbers[i]); // Запис i-того числа у масив
    }

    int *ptrnum = numbers; // Оголошення вказівника на масив
    int sum = 0; // Оголошення змінної для запису суми

    // Цикл для знаходження суми чисел
    for (int i = 0; i < SIZE; ++i) {
        sum += *ptrnum;
        ptrnum++;
    }
    
    // Обрахунок середньго значення чисел масиву
    int average = sum / SIZE;

    printf("Середнє арифметичне введених чисел: %d\n", average); // Виведення результату

    return 0; // Закінчення програми
}
